{
  "url": "https://www.uni-bamberg.de/en/ma-ai/admission/",
  "title": "Application and Admission - M. Sc. Applied Computer Science",
  "date": "2025-07-01",
  "content": "Application and Admission\nAdmission\nAdmission to the master’s degree programme in Applied Computer Science requires that a student have a completed a university or equivalent degree in the same major, or a closely related one, with a grade average of the German 2,7 or better.\nClosely related are degrees in all computer science programmes (in particular bioinformatics, communication and information technology, informatics, computer engineering, media informatics, health informatics, software systems science, and business informatics), as far as they include a extensive study of aspects of applied computer science and computer science and its foundations (i.e. a minimum of 90 ECTS credit points including a final thesis in applied computer science or computer science) and a study of application electives to an extent of at least 18 ECTS credit points. If a degree is accepted as closely related, is decided on an individual basis by the examination board.\nApplication\nPlease be aware that the application process can take several weeks. For the sake of planning your studies, you should apply as early as possible. We therefore recommend that you meet the following application deadlines:\nStudies beginning in the winter semester\n- Recommended application deadline: no later than 15th of September\nStudies beginning in the summer semester\n- Recommended application deadline: no later than 15th of March\nForeign applicants not currently residing in Germany should, if possible, apply earlier in order to leave enough time for language examinations, entry requirements and preparation, moving and getting acquainted with the new culture and academic environment.\nApplication Documents\nYour completed application must include the following documentation:\n- Certification of successful completion of the examination for general or restricted university entry qualification.\n- Certification of a completed university degree qualifying for entrance to the masters degree programme.\nIf the degree certificate is not yet available at the time of application, and your qualifying degree is conferred by a German university, you may turn in the certificate later. In this case the admission will be conditional only. - Documentation of modules, courses and examinations completed within the scope of your qualifying university degree (e.g. a transcript of records).\n- For foreign applicants: Certificates giving proof of your German language proficiency, at least of level B2, along with a copy of your identity card or passport.\n- Where applicable: professional credentials/ references, certificates from professional and continuing educational programmes, awards/ honours or voluntary service.\nPlease complete the Office of the Registrar’s Online Application for Admission.\nWhere do I upload or send my application materials?\nDomestic Applicants\nIf you obtained your Bachelor's degree in a German university, the application process is carried out through the online Application Portal of the Registrar's Office.\nForeign Applicants\nIf you obtained your Bachelor's degree in a foreign university, please send your application to the Registrar's Office via post: Otto-Friedrich-Universität Bamberg, Studierendenkanzlei, Kapuzinerstr. 25, 96049 Bamberg.\nMore Information\n- Enrolment\n- Central Student Advisory\n- Academic Regulations for the master´s programme M.Sc. Applied Computer Science\n- Information on language requirements"
}