{
  "url": "https://www.uni-bamberg.de/ma-ai/zulassung/",
  "title": "Bewerbung und Zugang - M. Sc. Angewandte Informatik",
  "date": "2025-07-01",
  "content": "Bewerbung und Zugang\nZugang\nDer Zugang zum Masterstudiengang Angewandte Informatik setzt einen Hochschulabschluss oder einen gleichwertigen Abschluss mit der Gesamtnote 2,7 oder besser mit mindestens 180 ECTS in einem verwandten Studiengang voraus. Falls Sie einen Bachelorstudienabschluss mit mehr als 180 ECTS bzw. 6 Semestern haben, sprechen Sie uns gerne bezüglich Anerkennungsmöglichkeiten an.\nVerwandte Studiengänge sind alle Studiengänge des Studienbereichs Informatik (insbesondere Bioinformatik, Computer- und Kommunikationstechniken, Informatik, Ingenieurinformatik/Technische Informatik, Medieninformatik, Medizinische Informatik, Software Systems Science, Wirtschaftsinformatik), sofern diese neben einem umfangreichen Studium der Angewandten Informatik und der Informatik sowie ihrer Grundlagen (mindestens 90 ECTS-Punkte inkl. Abschlussarbeit in Angewandter Informatik oder Informatik) auch das Studium von Anwendungsfächern in einem Umfang von mindestens 18 ECTS-Punkten umfassen. Ob der Studiengang in diesem Sinne als verwandt gilt, entscheidet der Prüfungsausschuss im Einzelfall.\nBewerbung\nBeachten Sie bitte, dass das Aufnahmeverfahren einige Wochen beanspruchen kann. Damit Sie Ihr Studium rechtzeitig planen können, sollten Sie sich möglichst frühzeitig bewerben. Wir empfehlen Ihnen deshalb, folgende Bewerbungstermine einzuhalten:\nStudienbeginn im Wintersemester\n- Empfohlener Bewerbungstermin: bis 15. September\nStudienbeginn im Sommersemester\n- Empfohlener Bewerbungstermin: bis 15. März\nAusländische Bewerberinnen und Bewerber, die nicht bereits in Deutschland leben, sollten sich nach Möglichkeit früher bewerben, um genügend Zeit für Sprachprüfungen, Einreisevorbereitungen, den Umzug sowie das Einleben in die neue Kultur und Studienumgebung zu haben.\nBewerbungsverfahren\nIm Zuge des Bewerbungsverfahren benötigen wir folgende Unterlagen:\n- Nachweis über die Prüfung der allgemeinen bzw. fachgebundenen Hochschulreife\n- Nachweis eines Hochschulabschlusses (falls zum Zeitpunkt der Bewerbung das Hochschulzeugnis noch nicht vorliegt, kann dieses nachgereicht werden - das gilt jedoch nicht für ausländische Bewerber)\n- Beleg über die im Rahmen des Hochschulstudiums erbrachten Studien- und Prüfungsleistungen (z.B. durch Zeugnis, aktuelle Notenübersicht, Leistungsübersicht bzw. Transcript of Records)\n- gegebenenfalls Zertifikate von Weiterbildungsmaßnahmen\n- bei ausländischen Bewerberinnen und Bewerbern zusätzlich einen Nachweis über Deutschkenntnisse mind. auf Niveau B2 und eine Kopie des Personalausweises bzw. Reisepasses\nWo kann ich meine Bewerbungsunterladen hochladen, oder wohin muss ich sie schicken?\nFür Bewerberinnen und Bewerber, die ihren qualifizierenden Bachelorgrad an einer deutschen Universität erworben haben, erfolgt die Bewerbung für den Masterstudiengang AI regulär online im Masterbewerbungsportal der Studierendenkanzlei.\nSofern Sie ausländische Zeugnisse im Rahmen Ihrer Bewerbung vorlegen, müssen diese mit einer amtlich beglaubigten deutschen oder englischen Übersetzung postalisch an die Studierendenkanzlei gesendet werden: Otto-Friedrich-Universität Bamberg, Studierendenkanzlei, Kapuzinerstraße 25, 96047 Bamberg.\nBewerberinnen und Bewerber, die ihren qualifizierenden Bachelorgrad an einer ausländischen Universität erworben haben, schicken ihre Bewerbungsunterlagen bitte, wenn nötig in einer amtlich beglaubigten deutschen oder englischen Übersetzung, postalisch an die Studierendenkanzlei: Otto-Friedrich-Universität Bamberg, Studierendenkanzlei, Kapuzinerstraße 25, 96047 Bamberg.\nWeitere Informationen\n- Bewerbung für einen Masterstudiengang - allg. Informationen der Studierendenkanzlei\n- Einschreibung\n- Zentrale Studienberatung\n- Studien- und Fachprüfungsordnung für den Masterstudiengang Angewandte Informatik der Otto-Friedrich-Universität Bamberg"
}