{
  "url": "https://www.uni-bamberg.de/ma-ai/ma-ai-faq/",
  "title": "FAQ - M. Sc. Angewandte Informatik",
  "date": "2025-07-01",
  "content": "Abschlussarbeiten (Bachelor-/Masterarbeit)\nJa. Die Abschlussarbeit zählt zum Prüfungszeitraum des Semesters, in dem sie abgegeben wurde, unabhängig vom Zeitpunkt der mündlichen Prüfung und vom Abgabetermin im Anmeldeformular der Arbeit. Daher ist eine Immatrikulation auch nur bis zur tatsächlichen Abgabe der Arbeit (inkl. Kolloquium) erforderlich. Für die Anmeldung sowie die Abgabe der Abschlussarbeit darf man nicht beurlaubt sein.\nEntscheidend ist das Datum der tatsächlichen Abgabe der Abschlussarbeit beim Prüfungsamt. Für den Zeitraum der Korrektur müssen Sie nicht immatrikuliert sein.\nIhre Abschlussarbeit muss nicht zwangsläufig an einem Lehrstuhl des Kerngebietes Ihres Studiengangs geschrieben werden. Bitte prüfen Sie zunächst die konkrete Regelung der StuFPO, gemäß der Sie studieren! Vielfach sind bereits mehrere mögliche Fachbereiche dort aufgeführt.\nIst der Lehrstuhl, an dem Sie Ihre Abschlussarbeit schreiben möchten, nicht explizit in diesem Zusammenhang in Ihrer StuFPO (Anhang) genannt, ist ein Antrag an den Prüfungsausschuss notwendig. Mit diesem Antrag ist nachzuweisen, dass das gestellte Thema inhaltlichen Bezug zum aktuellen Studiengang aufweist.\nFür die Genehmigung müssten Sie ein Exposé zum Inhalt der Arbeit einreichen, aus dem hervorgeht, inwiefern in der Arbeit ein Bezug zum Kernfach Ihres Studiengangs (Informatik bzw. Angewandte Informatik) besteht. Dieser sollte inhaltlicher Natur sein und sich nicht nur auf erworbene Kenntnisse beziehen. Darüber hinaus müssten Sie dem Prüfungsausschussvorsitzenden den geplanten endgültigen Titel der Arbeit nennen, da dieser Bestandteil der Genehmigung ist und im Anschluss nicht mehr geändert werden kann.\nEin Antrag ist selbstständig per Mail an den Prüfungsausschuss zu stellen.\nAnerkennung von Prüfungsleistungen\nSofern der Wechsel zwischen zwei Studiengängen innerhalb der Universität Bamberg stattfindet, senden Sie bitte das Notenblatt, welches Sie aus FlexNow2 generieren, an den Prüfungsausschuss Informatik und Angewandte Informatik. Ferner senden Sie einen Anerkennungsantrag (zu finden im vc-Kurs des Prüfungsausschusses) mit.\nSofern Sie bisher an einer anderen Universität studiert haben, machen Sie bitte einen Termin mit dem Prüfungsausschuss aus. Weitere Informationen finden Sie unter Anerkennung von Studienzeiten, Prüfungsleistungen und Studienleistungen.\nEine Hochstufung um jeweils ein Fachsemester findet bei einer Anerkennung bzw. Anrechnung von >= 30 ECTS-Punkte statt. Die Hochstufung wird zusammen mit der Anerkennung durchgeführt. Ein gesonderter Antrag ist nicht notwendig. Bitte wenden Sie sich zu Fragen an den Prüfungsausschuss Informatik und Angewandte Informatik.\nWir empfehlen die Anerkennung bereits erbrachter Studienleistungen, z.B. aus einem vorangegangenen Studium, zeitnah und zum Start des Studiums vorzunehmen. Wir möchten dadurch vermeiden, dass z.B. Anerkennungen nicht mehr möglich sind (siehe nächstes FAQ-Item) oder die Studienfortschrittskontrolle (Studien- und Fachprüfungsordnung §34 der Bachelorstudiengänge) das Studium in Bedrängnis bringt.\nEin Antrag auf Anerkennung ist nicht mehr möglich, sobald die oder der Studierende sich in einem das entsprechende Modul betreffenden Prüfungsverhältnis mit der Hochschule befindet (bspw. nach erfolgter Anmeldung für eine Prüfung), bei der sie oder er um Anerkennung ersucht.\nGrundsätzlich sollte die Einreichung von Scheinen nicht mehr nötig sein. Wenn Sie sich für eine Prüfung nicht regulär über FlexNow anmelden können, ist dies möglicherweise ein Zeichen dafür, dass Sie das Modul nicht in Ihren Studiengang einbringen können! In diesem Fall sollten Sie zunächst die Regelungen in Ihrer StuFPO prüfen und bei immer noch vorhandenem Zweifel beim Prüfungsausschuss nachfragen. Möglicherweise kann auch die reguläre Prüfungsanmeldung über FlexNow für Sie freigeschaltet werden.\nSollte wirklich die Belegung der Modulprüfung \"auf Schein\" die einzige Möglichkeit sein, reichen Sie den Schein im Prüfungsausschuss zur Anerkennung ein. Ein eingereichter Schein ist jedoch - ohne vorherige Bestätigung durch den Prüfungsausschuss - keine Garantie dafür, dass das belegte Modul tatsächlich in den Studiengang eingebracht werden kann.\nAuslandsstudium\nEs gibt zwei Möglichkeiten der Anerkennung von an einer anderen Hochschule erbrachten Leistungen:\n1. Modulanerkennung: Sofern das angebotene Modul (bspw. „Artificial Intelligence“) keinen \"wesentlichen Unterschied\" zu einem konkreten Bamberger Modul (bspw. AI-KI-B) aufweist, kann es als das Bamberger Modul angerechnet werden. Hierfür müssen Sie den Modulanbieter des entsprechenden Bamberger Lehrstuhls (bspw. Smart Environments) bitten, die Anerkennbarkeit des erbrachten Moduls für das entsprechende Bamberger Modul zu bestätigen. Bestätigt dieser Ihnen, dass kein \"wesentlicher Unterschied\" der beiden Module vorliegt, kann das Bamberger Modul anstelle des erworbenen Moduls anerkannt werden. Dieses Vorgehen ist vor allem bei der Ersetzung von Bamberger Pflichtmodulen notwendig.\n2. Modulgruppenanerkennung: Das anzuerkennende Modul entspricht keinem Bamberger Modul so passgenau, dass eine Modulanerkennung sinnvoll ist. Es passt jedoch hinsichtlich der Inhalte und erworbenen Kompetenzen in eine vorgesehene Modulgruppe und kann ohne Gleichwertigkeit mit einem Bamberger Modul anerkannt werden. Dieses Vorgehen ist nur im Wahlpflichtbereich möglich. Module des Pflichtbereiches können nur durch eine Modulanerkennung ersetzt werden.\nKonkrete Fragen zur Modulgruppenanerkennung beantwortet Ihnen gerne der Prüfungsausschuss.\nBeachten Sie bitte, dass laut Studien- und Fachprüfungsordnung „die zu erbringenden Prüfungsleistungen vor Antritt des Auslandsaufenthaltes mit dem zuständigen Prüfungsausschuss vereinbart werden“ sollen.\nDarauf gibt es keine generelle Antwort. Grundsätzlich besteht die Möglichkeit, sich für ein Auslandsstudium beurlauben zu lassen. Ein Urlaubssemester bedeutet, dass Ihre Fachsemesterzahl erstmal nicht steigt. Dennoch wird Ihnen bei Anerkennung Ihrer Leistungen nachträglich pro 30 ECTS-Punkte, welche Ihnen aus dem Auslandsstudium anerkannt werden, ein Fachsemester hinzugezählt.\nWenn Sie beurlaubt sind, können Sie an der Universität Bamberg nur an Wiederholungsprüfungen teilnehmen. Bei weiteren Fragen wenden Sie sich bitte direkt an die Studierendenkanzlei, die für Beurlaubungen zuständig ist.\nIn einem Learning Agreement bestätigen wir Ihnen, welche der von Ihnen gewählten ausländischen Kurse in Ihrem Studiengang in Bamberg anerkannt werden können. Das Formular dazu finden Sie im VC-Kurs des Prüfungsausschusses.\nDarüber hinaus gibt es ein Erasmus Learning Agreement, welches häufig vom AAA (Akademisches Auslandsamt) unterschrieben wird. Dieses hat für die Anerkennung von Modulen seitens des Prüfungsausschusses keine Verbindlichkeit.\nDas Learning Agreement dient Ihrer eigenen Planungssicherheit: Wenn Sie sich Kurse, die Sie im Ausland erbracht haben oder erbringen werden, in Ihrem Studium anrechnen lassen möchten, müssen diese durch den Prüfungsausschuss genehmigt werden. Geschieht dies im Vorfeld des Auslandsstudiums, vereinbaren wir ein Learning Agreement. Haben Sie kein Learning Agreement vereinbart und die Prüfung der ausländischen Kurse erfolgt somit erst nach dem Auslandsaufenthalt, so kann es passieren, dass Sie erst jetzt erfahren, dass nicht alle von Ihnen gewählten Kurse angerechnet werden können.\nGrundsätzlich werden für ein Learning Agreement Modulbeschreibungen der ausländischen Module benötigt.\nMöchten Sie ein Bamberger Modul durch ein ausländischen Modul ersetzen, schließen Sie das Learning Agreement mit dem Fachvertreter ab.\nMöchten Sie ausländische Module in Wahlpflichtbereichen einbringen, so schließen Sie das Learning Agreement direkt mit dem Prüfungsausschuss ab. Wenden Sie sich dafür an den Prüfungsausschuss.\nFormulare sowohl für die Modulanrechnung als auch für die Modulgruppenanrechnung finden Sie im vc-Kurs des Prüfungsausschusses.\nSollte sich etwas an Ihrer Kurswahl an der ausländischen Universität ändern (z.B., weil geplante Module nicht zur Verfügung stehen), so kontaktieren Sie bitte den Prüfungsausschuss. Über zusätzliche Module oder Änderungen an bestehenden Modulen kann dann auch per E-Mail ein Learning Agreement ausgestellt werden.\nJa, sofern die ausländischen Module fachlich passend sind. Wenden Sie sich dann mit Modulbeschreibungen und dem ausländischen Zeugnis an den Prüfungsausschuss Informatik / Angewandte Informatik. Sinnvoller und für Sie persönlich planungssicherer ist es jedoch, diese Absprachen per Learning Agreement im Vorhinein zu treffen.\nNach Ihrem Auslandsstudium reichen Sie bitte das Zeugnis, das Learning Agreement (bzw., falls nicht getroffen, aussagekräftige Modulbeschreibungen) sowie den ausgefüllten Antrag auf Anerkennung beim Prüfungsausschuss Informatik/ Angewandte Informatik ein. Die Formulare finden Sie im VC-Kurs.\nBei einer Modulgruppenanerkennung werden die ECTS-Punkte anerkannt, die Sie im Ausland dafür erhalten haben. Bei einer Modulanerkennung werden die ECTS-Punkte des Bamberger Moduls verbucht. Siehe auch Anerkennung von Prüfungsleistungen.\nIn einigen Fällen gibt es Empfehlungen zur Notenumrechnung, welche von der Partneruniversität herausgegeben werden. Sofern dies der Fall ist, fügen Sie diese Umrechnungsempfehlung dem Anrechnungsantrag bei. Sofern die Umrechnungsempfehlungen von uns anerkannt werden, werden wir diese berücksichtigen. Sollte es keine Umrechnungsempfehlungen geben, wird die offizielle „bayerische Formel\" verwendet.\nAuswahl von Modulen\nSie können zusätzliche Module im freiwilligen Zusatzbereich belegen. Nachdem Sie die Prüfung absolviert haben und die Note feststeht, können Sie den Tausch des Moduls aus dem freiwilligen Zusatzbereich mit einem Modul aus einem Wahlpflichtbereich beim Prüfungsamt per E-Mail veranlassen.\nBeachten Sie bitte, dass ein Tausch nicht mehr möglich ist, wenn Sie bereits alle ECTS-Punkte für Ihr Studium erbracht haben, da in diesem Fall das Studium bereits abgeschlossen ist.\nFür die Bachelorstudiengänge AI und Inf: SoSySc sowie den Masterstudiengang CitH:\nWählbar sind Module gemäß dem Angebot des Sprachenzentrums Bamberg (Modulhandbuch des Sprachenzentrums), ausgenommen die Module der Bereiche Deutsch als Fremdsprache und Wirtschaftsdeutsch. Empfohlen werden die Sprachkurse IT English.\nFür den Masterstudiengang ISoSySc:\nWählbar sind Module gemäß dem Angebot des Sprachenzentrums Bamberg (Modulhandbuch des Sprachenzentrums). Ausgenommen ist für ISoSySc die Einbringung von Englisch-Modulen sowie die Einbringung von Modulen der Sprache, in der die Hochschulzugangsberechtigung erworben wurde.\nAllgemeines:\n- Im Masterstudiengang AI ist keine Einbringung von Sprachmodulen möglich.\n- Die Einbringung von Sprachmodulen soll nicht mehr über Scheine abgewickelt werden! Bitte schreiben Sie stattdessen dem Prüfungsausschuss, welches Modul Sie belegen möchten. Die Anmeldung wird dann im FlexNow für Sie freigeschaltet.\n- Beachten Sie, dass für die Wirtschaftsfremdsprachen jeweils beide Teilmodulprüfungen erfolgreich bestanden werden müssen, damit die 6 ECTS-Punkte angerechnet werden können. Z.B. Für Wirtschaftsenglisch (arabisch) 1 muss Wirtschaftsenglisch (römisch) I und Wirtschaftsenglisch (römisch) III erfolgreich belegt werden.\nWollen Sie weitere Module an der Universität Bamberg belegen, so können Sie sich zu den Prüfungen in diesen Modulen im freiwilligen Zusatzbereich anmelden. Am Ende Ihres Studiums kann darüber ein Zusatzzeugnis ausgestellt werden.\nAnerkannte Leistungen anderer Hochschulen, z.B. aus dem Vorstudium oder dem Auslandsaufenthalt, können nicht unter den freiwilligen Zusatzleistungen anerkannt werden.\nEs ist immer jeweils nur das aktuellste Modulhandbuch entsprechend Ihrer Studien- und Prüfungsordnung gültig und muss zum Studieren herangezogen werden.\nNotenberechnung\nDie Note in einer Modulgruppe ergibt sich aus dem mit den Kreditpunkten gewichteten und auf eine Kommastelle abgeschnittenen arithmetischen Mittel der Modulnoten. Sofern die Leistungen in ECTS-Punkte die Modulobergrenze überschreiten, werden die überschüssigen ECTS-Punkte von dem am schlechtesten bewerteten Modul abgeschnitten.\nDie Abschlussnote ergibt sich aus dem auf eine Kommastelle abgeschnittenen, gewichteten, arithmetischen Mittel der Noten der einzelnen Module.\nDie Prüfungsfächer der einzelnen Modulgruppen sind in Anhang 1 der Studien- und Fachprüfungsordnungen für die Studiengänge definiert. Nur in den sieben-semestrigen Bachelorstudiengängen fließen Grundlagenmodule nicht mit in die Abschlussnote ein. Sowohl in den sechs- als auch sieben-semestrigen Bachelorstudiengängen fließen Module des Kontextstudiums nicht mit in die Abschlussnote ein.\nDie im Zeugnis ausgewiesene Note wird nach der ersten Kommastelle abgeschnitten. Bsp.: Die berechnete Note 2,18 wird als 2,1 im Zeugnis ausgewiesen.\nPrüfungen\nEine Prüfung, die im Rahmen eines Studiengangs an der WIAI absolviert wird, kann innerhalb der Höchststudiendauer beliebig oft wiederholt werden.\nDie Bachelor- / Masterarbeit kann nur einmal wiederholt werden.\nSofern es sich um ein Wahlpflichtmodul handelt, können Sie ein anderes Modul aus dem Wahlpflichtbereich wählen. Teilen Sie bitte dem Prüfungsamt mit (Kontaktformular), für welches Modul Sie an keinen weiteren Prüfungen teilnehmen werden. Teilen Sie dem Prüfungsamt diese Information bitte bereits vor der Prüfungsanmeldephase mit. Falls Sie dies nicht vor der Prüfungsmeldephase kundgeben, kann es sein, dass sich Sie nicht zu Prüfungen in FlexNow anmelden können bzw. FlexNow eine Anmeldung zu Prüfungen verweigert!\nNicht bestandene Leistungen werden im Abschlusszeugnis nicht aufgeführt. Sofern freiwillige Zusatzleistungen absolviert wurden, wird ein weiteres Zeugnis ausgestellt, auf dem alle bestandenen, freiwilligen Zusatzleistungen verzeichnet sind. Weitere Informationen zum Abschlusszeugnis erhalten Sie vom Prüfungsamt.\nSiehe Allgemeine Prüfungsordnung der WIAI!\n\"§ 20 Endgültiges Nichtbestehen\n(1) Sind nach Ablauf der Höchststudiendauer gemäß § 30 Abs. 2 StuFPO nicht alle im Studiengang zu erbringenden Prüfungsleistungen bestanden, so müssen die noch ausstehenden Prüfungsleistungen innerhalb des nach Ablauf der Höchststudienzeit anschließenden Hochschulsemesters erbracht werden. Hierzu wird die Prüfungskandidatin bzw. der Prüfungskandidat schriftlich aufgefordert. Sind nach Ablauf dieser Frist nicht alle erforderlichen Prüfungsleistungen bestanden, ist der jeweilige Studiengang endgültig nicht bestanden. In diesem Fall ist das Prüfungsverfahren beendet. Noch ausstehende Prüfungsleistungen oder eine in Bearbeitung befindliche Bachelor- oder Masterarbeit können nicht mehr als Prüfungsleistungen im Sinne dieser Prüfungsordnung erbracht werden.\"\nSofern eine Bachelor- oder Masterarbeit bereits angemeldet wurde, so zählt diese zwangsläufig als \"erstmalig nicht bestanden\", wenn sie nicht bis zum Ende der regulären Höchststudienzeit abgegeben wird. Meldet also z.B. eine Studierende des Bachelor AI mit einer Regelstudienzeit von 6 Semestern (und dementsprechend einer regulären Höchststudiendauer von 8 Semestern) einen Monat vor Ablauf des 8. Semesters ihre Bachelorarbeit an, beträgt die Bearbeitungszeit nicht mehr wie üblich 4 Monate, sondern nur bis zum Ende der regulären Höchststudiendauer. Sie hat in diesem Fall zwar gemäß APO WIAI, § 20, weiterhin die Möglichkeit, eine Bachelorarbeit abzugeben und ihr Studium abzuschließen. Das einmal begonnene Thema darf aber nicht weiterbearbeitet werden, sondern es wird im neuen Semester ein neues Thema der Abschlussarbeit ausgegeben.\nDer Abgabetermin ist jeweils in FlexNow hinterlegt. Eine nicht bestandene Bachelor- bzw. Masterarbeit kann gemäß § 18 einmal wiederholt werden.\nPrüfungsanmeldung / Probleme bei der Anmeldung\nIch habe vergessen mich zu den Prüfungen anzumelden. Was kann ich tun?\nSie sind offenbar nicht im VC-Kurs des Prüfungsausschusses angemeldet - dort wird regelmäßig und fristgerecht an die Prüfungsanmeldefristen erinnert.\nDie Anmeldefristen sind für jeden Studierenden verbindlich. Bei Versäumnis kann die Anmeldung leider nicht nachgeholt werden. Denken Sie im kommenden Semester rechtzeitig an die Prüfungsanmeldung. Melden Sie sich im VC-Kurs des Prüfungsausschusses an!\nWenn Sie ein Modul über die FlexNow-Suche während der Prüfungsanmeldephase anmelden, so wird dieses Modul im Freiwilligen Zusatzbereich und nicht in der dafür vorgesehenen Modulgruppe verbucht. Module, die im Freiwilligen Zusatzbereich verbucht werden, zählen nicht zur Studienfortschrittskontrolle.\nDaher sollten Sie die Prüfungen über die Baumansicht anmelden, damit diese Module der entsprechenden Modulgruppe zugeordnet werden.\nNein. Module müssen nicht im darauffolgenden Semester wiederholt werden. Sie müssen sich stattdessen zum nächsten gewünschten Termin selbstständig anmelden, sofern Sie an einer Wiederholungsklausur teilnehmen möchten. Sofern es sich um ein Wahlpflichtmodul handelt, können Sie auch ein anderes Modul aus dem Wahlpflichtbereich wählen. Teilen Sie dies jedoch dem Prüfungsamt mit. Andernfalls kann es vorkommen, dass Sie Probleme bei der Anmeldung in der entsprechenden Modulgruppe haben.\nNein, Sie müssen sich selbstständig erneut für die Prüfung anmelden.\nImmer wieder kann es zu Problemen während der Prüfungsanmeldung kommen, insb. kann eine Anmeldung über FlexNow nicht möglich sein, obwohl Sie in den jeweiligen Modulgruppen noch Leistungen erbringen müssen.\nWie kommt dieses Problem zustande?\nInsbesondere ist darauf zu achten, dass Sie sich von Prüfungen, für die Sie einmal angemeldet waren, die Sie aber nicht mehr ablegen möchten, wieder abmelden. Hier ein Beispiel:\nNehmen wir an, Sie haben sich im WS 19/20 in einer Modulgruppe (24 ECTS-Punkte) für folgende Module über FlexNow angemeldet:\nDSG-EiAPS-B (6 ECTS-Punkte, angemeldet)\nMI-AuD-B (6 ECTS-Punkte, angemeldet)\nPSI-IntroSP-B (6 ECTS-Punkte, angemeldet)\nDabei haben Sie jedoch nur DSG-EiAPS-B (6 ECTS-Punkte) und MI-AuD-B (6 ECTS-Punkte) bestanden. PSI-IntroSP-B konnten Sie leider nicht antreten oder haben es nicht bestanden.\nIm SS20 würden Sie nun gerne folgenden Module belegen:\nSWT-FSE-B (6 ECTS-Punkte)\nMOBI-DBS-B (6 ECTS-Punkte)\nDas Modul PSI-IntroSP-B möchten Sie nicht mehr belegen.\nIn diesem Fall erzeigt FlexNow dennoch einen Fehler bei der Anmeldung, da mehr als 24 ECTS-Punkte in der Modulgruppe verbucht sind.\nGrund: Das nicht bestandene Modul PSI-IntroSP-B zählt in die 24-ECTS-Punkte Punktegrenze mit ein!\nWie können Sie sich trotzdem ohne Fehlermeldung in FlexNow zu den Prüfungen anmelden?\nSchreiben Sie dem Prüfungsamt, welches Modul Sie nicht mehr belegen möchten, beantragen Sie entsprechend einen Teilprüfungswechsel.\nWann sollten Sie sich beim Prüfungsamt melden?\nMelden Sie diese Punkte bereits vor der Prüfungsanmeldung zum Start des jeweiligen Semesters!\nKontakt beim Prüfungsamt:\nBei Problemen zur Prüfungsanmeldung setzen Sie sich mit dem Prüfungsamt WIAI in Verbindung (Kontaktformular). Schildern Sie das Problem detailliert und wie es Ihrer Meinung nach in FlexNow normalerweise dargestellt wäre.\nNein! Falls Sie sich für ein Modul, welches Sie im Profilbildungsbereich / Freiwilligen Zusatzbereich belegen möchten und das Teil des Curriculums ist, nicht über FlexNow anmelden können, so setzen Sie sich mit dem Prüfungsamt WIAI in Verbindung (Kontaktformular).\nSchildern Sie bitte detailliert, welches Modul Sie gerne einbringen möchten. In den meisten Fällen kann das Modul entsprechend freigeschalten werden, sodass eine Anmeldung über FlexNow möglich wird und Sie die Klausur nicht auf Schein schreiben müssen.\nSofern es sich um ein Wahlpflichtmodul handelt, können Sie ein anderes Modul aus dem Wahlpflichtbereich wählen. Teilen Sie bitte dem Prüfungsamt mit (Kontaktformular), für welches Modul Sie an keinen weiteren Prüfungen teilnehmen werden.\nTeilen Sie diese Information bitte dem Prüfungsamt bereits vor der Prüfungsanmeldephase mit. Falls Sie dies nicht vor der Prüfungsmeldephase kundgeben, kann es sein, dass sich Sie nicht zu Prüfungen in FlexNow anmelden können bzw. FlexNow eine Anmeldung zu Prüfungen verweigert, da die Modulgruppengrenze überschritten wird.\nBereits angemeldete und nicht bestandene Module werden von FlexNow ebenfalls und fälschlicherweise mit den entsprechenden ECTS-Punkten gewertet und verhindert somit eine Anmeldung bei Überschreitung der Modulgruppengrenze.\nJa, Sie sollten sich entweder gar nicht zur Klausur anmelden oder während der Prüfungsabmeldephase auch wieder abmelden.\nFalls ein Modul in einer falschen Modulgruppe angemeldet wurde, wenden Sie sich für die Verschiebung während der Prüfungsanmeldung an das Prüfungsamt WIAI (Kontaktformular).\nAchten Sie bei den nächsten Prüfungsanmeldungen darauf, die korrekte Modulgruppe auszuwählen. Wenn Sie eine Prüfung über die \"Suche\" auswählen, wird die Prüfung häufig den \"freiwilligen Zusatzmodulen\" zugeordnet.\nÜbergang Bachelor - Master\nJa, Sie können im Bachelorstudium auch Mastermodule im freiwilligen Zusatzbereich verbuchen und diese durch den Prüfungsausschuss anerkennen lassen, sobald Sie im Masterstudiengang an der WIAI-Fakultät eingeschrieben sind und Sie das Bachelorzeugnis erhalten haben. Achten Sie darauf, dass die gewählten Mastermodule in dem angestrebten Masterstudiengang laut Modulhandbuch einbringbar sind. Senden Sie dem Prüfungsausschuss Informatik / Angewandte Informatik hierzu einen entsprechenden Anerkennungsantrag (zu finden im vc-Kurs des Prüfungsausschusses).\nEs besteht darüber hinaus die Möglichkeit, sich parallel in den Bachelor- und den Masterstudiengang einzuschreiben, sodass Sie Ihre letzten Prüfungsleistungen im Bachelorstudium und Ihre ersten Prüfungsleistungen im Masterstudium im gleichen Semester parallel erbringen können. Voraussetzung dafür ist aber, dass Sie bereits zum Masterstudium zugelassen sind. Ob diese Möglichkeit für Sie sinnvoll ist, liegt in Ihrem eigenen Ermessen.\nSie können sich zum Masterstudium bewerben, auch wenn noch nicht alle Noten zum erfolgreichen Abschluss des Bachelorstudiums vorliegen. Auch wenn Ihnen nur noch wenige ECTS-Punkte im Bachelorstudium fehlen, ist eine Bewerbung schon möglich. Falls das Zeugnis für die Einschreibung noch nicht vorhanden ist, muss das fehlende Zeugnis innerhalb eines Jahres bei der Studierendenkanzlei nachgerecht werden.\nWenn Sie ihr Bachelorstudium im WiSe (SoSe) abschließen wollen, so müssen Sie Ihre letzte Prüfungsleistung bis zum 31.03. (30.09.) erbracht haben. Ist Ihre letzte Prüfungsleistung die Bachelorarbeit, so ist der letzte Tag des Semesters auch der letztmögliche Abgabetermin.\nEs besteht die Möglichkeit, sich parallel in den Bachelor- und den Masterstudiengang einzuschreiben, so dass Sie Ihre Bachelorarbeit auch erst in dem Semester abgegeben können, in dem Sie bereits Mastermodule belegen wollen. Voraussetzung dafür ist aber, dass Sie bereits zum Masterstudium zugelassen sind.\nZugangsvoraussetzungen\nDa es an der Universität Bamberg keine ENB-Klausel gibt, können Sie sich problemlos an der WIAI einschreiben.\nEinschreiben für ein Bachelorstudium: zentrale Fristen.\nBewerbung für ein Masterstudium: Für die Bewerbung zum Master gelten folgende Bewerbungsfristen (siehe Ankündigung Studierendenkanzlei). Bitte beachten Sie jedoch, dass aus organisatorischen Gründen Bewerbungen für das Wintersemester bis zum 31.08., für das Sommersemester bis zum 28.02. eines Jahres erfolgen sollten. Nach Eingang Ihrer Bewerbung wird diese sofort bearbeitet und das Bewerbungsverfahren innerhalb kurzer Zeit zum Abschluss gebracht. Sie erhalten dann eine Zu- bzw. Absage und können so frühzeitig Ihr Masterstudium planen.\nFür das Studium benötigen Sie kein Orientierungs- oder Betriebspraktikum.\nAls Zugangsvoraussetzungen werden gute Deutsch-, Englisch- und Mathematikkenntnisse erwartet. Sie können jedoch unzureichende Kenntnisse frühzeitig, z.B. durch einen Mathe-Vorkurs oder Englisch-Kurs ergänzen.\nSoweit sie die Zulassungsvoraussetzungen erfüllen, können Sie sich für den für Sie interessanten Studiengang einschreiben bzw. bewerben. Bei besonderen Abweichungen (ausländische Hochschulzugangsberechtigung etc.) und für weitere Anliegen ausländischer Studierender hilft das Akademische Auslandsamt weiter.\nSonstiges\nDen Stunden- und Studienplan, der bei den EETs vorgestellt wird finden Sie auf den Webseiten der Fachschaft. Außerdem fasst die aktuellste Broschüre auch alle wichtigen Informationen zusammen, die insb. bei der Facheinführung vorgestellt werden.\nWeitere Informationen, wie Sie den Stundenplan im Univis erstellen, finden Sie hier. Weitere praktische Informationen für den Studienstart finden Sie auf den Webseiten der Studierendenkanzlei. (Vorlesungszeiten- und Fristen, Studienförderung, Internet-Dienste, Semesterticket, Studierendenausweis, Rückmeldung, Wechsel, Beurlaubung, Exmatrikulation).\nJa, die Fakultät hat ein eigenes Career Center. Hier können Sie sich über aktuelle Events informieren und nach Kooperationspartnern suchen. In dem VC-Kurs „Jobbörse WIAI\" werden regelmäßig aktuelle Jobangebote eingestellt. Sollten Sie detaillierte Fragen haben, können Sie sich jederzeit an das Career Center WIAI wenden.\nSobald alle Noten Ihrer Bachelor- oder Masterprüfung in FlexNow verbucht sind, wird das Zeugnis vom Prüfungsamt erstellt. Dieses muss dann noch vom Dekan der Fakultät und dem Prüfungsausschussvorsitzenden unterschrieben werden. Außerdem wird noch die Urkunde Ihres akademischen Grads erstellt und vom Präsidenten unterschrieben. Ist dies alles erfolgt, werden Sie benachrichtigt und Sie können Ihr Zeugnis im Prüfungsamt abholen.\nWenn Sie noch freiwillige Zusatzleistungen absolvieren, so zögert sich das Erstellen des Zeugnisses noch bis zum Ende des jeweiligen Semesters heraus."
}