{
  "url": "https://www.uni-bamberg.de/en/ma-ai/faq/",
  "title": "FAQ - M. Sc. Applied Computer Science",
  "date": "2025-07-01",
  "content": "Theses (Bachelor / Master thesis)\nYes. The thesis counts during the examination period of the semester in which it was submitted, regardless of the time of the oral examination and the submission date in the registration form for the thesis. Therefore, enrollment is only required until the actual submission of the thesis. You may not be on leave to register or submit your thesis.\nThe date of the actual submission of the thesis to the examination office is decisive. You do not have to be enrolled for the correction period.\nYour thesis does not necessarily have to be written at a chair in the core area of your degree program. Please first check the specific rules of the StuFPO according to which you are studying! In many cases, several possible subject areas are already listed there.\nIf the chair at which you would like to write your thesis is not explicitly mentioned in this context in your StuFPO (appendix), an application to the examination board is necessary. With this application, it must be proven that the topic is related to the current course of study.\nFor approval, you would have to submit an exposé on the content of the thesis, which shows the extent to which the thesis relates to the core subject of your course of study (computer science or applied computer science). This should be content-related and not just refer to acquired knowledge. In addition, you would have to give the chairman of the examination board the planned final title of the thesis, as this is part of the approval and cannot be changed afterwards.\nAn application must be made independently by email to the examination board.\nRecognition of examination results\nIf the change between two courses takes place at the University of Bamberg, please send the grade sheet that you generate from FlexNow2 to the Examination Board for Computer Science and Applied Computer Science. You also send an application for recognition (to be found in the vc course of the examination board).\nIf you have previously studied at another university, please make an appointment with the examination board. Further information can be found under Recognition of study periods, examination achievements and course achievements.\nUpgrading by one semester takes place when> = 30 ECTS points are recognized or credited. The upgrade is carried out together with the recognition. A separate application is not necessary. If you have any questions, please contact the Examination Committee for Computer Science and Applied Computer Science.\nWe recommend the recognition of previous academic achievements, e.g. from a previous degree, promptly and at the start of the degree. We want to avoid that e.g. Recognition is no longer possible (see next FAQ item) or the study progress control (study and subject examination regulations §34 of the Bachelor's degree programs) brings the studies into distress.\nAn application for recognition is no longer possible as soon as the student is in an examination relationship with the university (e.g. after registering for an examination) from which he or she is requesting recognition.\nIn principle, it should no longer be necessary to submit certificates. If you cannot register for an exam regularly via FlexNow, this may be a sign that you cannot incorporate the module into your degree program! In this case, you should first check the regulations in your StuFPO and, if you still have doubts, ask the examination board. You may also be able to activate the regular exam registration via FlexNow.\nIf taking the module examination \"on a certificate\" is really the only option, submit the certificate to the examination board for recognition. However, a submitted certificate - without prior confirmation by the examination board - is no guarantee that the module can actually be included in the course.\nStudy abroad\nThere are two ways of recognizing achievements at another university:\n1. Module approval: If the offered module (e.g. \"Artificial Intelligence\") does not show any \"significant difference\" to a specific Bamberg module (e.g. AI-KI-B), it can be counted as the Bamberg module. To do this, you must ask the module provider of the Bamberg chair in question (e.g. Smart Environments) to confirm that the module can be recognized for the relevant Bamberg module. If this confirms that there is no \"significant difference\" between the two modules, the Bamberg module can be recognized instead of the acquired module. This procedure is particularly necessary when replacing compulsory modules from Bamberg.\n2. Module group recognition: The module to be recognized does not correspond to any Bamberg module so precisely that module recognition makes sense. However, in terms of content and acquired competencies, it fits into a planned module group and can be recognized without being equivalent to a Bamberg module. This procedure is only possible in the compulsory elective area. Modules in the compulsory area can only be replaced by module recognition.\nThe examination board will be happy to answer specific questions about module group recognition.\nPlease note that, according to the study and subject examination regulations, \"the examinations to be performed should be agreed with the responsible examination board before starting the stay abroad\".\nBeachten Sie bitte, dass laut Studien- und Fachprüfungsordnung „die zu erbringenden Prüfungsleistungen vor Antritt des Auslandsaufenthaltes mit dem zuständigen Prüfungsausschuss vereinbart werden“ sollen.\nThere is no general answer to that. Basically, there is the possibility of taking a leave of absence to study abroad. A semester on leave means that your number of semesters does not increase for the time being. Nevertheless, if your achievements are recognized, you will be added one semester for every 30 ECTS points recognized from your studies abroad.\nIf you are on leave, you can only take repeat exams at the University of Bamberg. If you have any further questions, please contact the student office responsible for leave of absence.\nIn a learning agreement, we confirm which of the foreign courses you have chosen can be recognized in your degree program in Bamberg. The form for this can be found in the VC course of the examination board.\nIn addition, there is an Erasmus Learning Agreement, which is often signed by the AAA (International Office). This is not binding for the recognition of modules by the examination board.\nThe learning agreement helps you to plan ahead: if you want to have courses that you have completed or will take abroad count towards your studies, these must be approved by the examination board. If this happens in advance of the study abroad, we will make a learning agreement. If you have not agreed a learning agreement and the examination of the foreign courses will only take place after the stay abroad, you may only find out now that not all of the courses you have chosen can be taken into account.\nIn principle, module descriptions of the foreign modules are required for a learning agreement.\nIf you would like to replace a Bamberg module with a foreign module, conclude the learning agreement with the specialist representative.\nIf you would like to include foreign modules in compulsory elective areas, conclude the learning agreement directly with the examination board. Please contact the examination board for this.\nYou can find forms for both module credit and module group credit in the vc course of the examination board.\nIf something changes in your choice of course at the foreign university (e.g. because planned modules are not available), please contact the examination board. A learning agreement can then also be issued by email for additional modules or changes to existing modules.\nYes, as long as the foreign modules are technically appropriate. Then contact the Computer Science / Applied Computer Science Examination Board with module descriptions and the foreign certificate. However, it is more sensible and more reliable for you personally to make these arrangements in advance using a learning agreement.\nAfter your studies abroad, please submit the certificate, the learning agreement (or, if not made, a meaningful module description) and the completed application for recognition to the Examination Committee for Computer Science / Applied Computer Science. You can find the forms in the VC course.\nIn the case of module group recognition, the ECTS points you have received abroad are recognized. If the module is recognized, the ECTS points of the Bamberg module are recorded. See also recognition of examination results.\nIn some cases there are recommendations for grade conversion, which are issued by the partner university. If this is the case, add this conversion recommendation to the credit application. If the conversion recommendations are accepted by us, we will take them into account. If there are no conversion recommendations, the official \"Bavarian formula\" will be used.\nSelection of modules\nYou can take additional modules in the voluntary additional area. After you have completed the exam and your grade has been determined, you can arrange for the module from the optional additional area to be exchanged for a module from an elective area at the examination office by email.\nPlease note that an exchange is no longer possible if you have already earned all ECTS points for your degree, as in this case the degree has already been completed.\nFor the AI and Inf: SoSySc bachelor programs and the CitH master’s program:\nModules according to the offer of the Language Center Bamberg (module handbook of the Language Center) can be selected, with the exception of the modules in the areas of German as a Foreign Language and Business German. The IT English language courses are recommended.\nFor the master's program ISoSySc:\nModules can be selected according to the offer of the Language Center Bamberg (module handbook of the Language Center). For ISoSySc, the introduction of English modules and the introduction of modules in the language in which the university entrance qualification was acquired is excluded.\nGeneral:\n- Language modules cannot be incorporated into the AI master’s course.\n- The introduction of language modules should no longer be carried out using bills! Instead, please write to the examination board which module you would like to take. The registration will then be activated for you in FlexNow.\n- Please note that both sub-module examinations must be passed successfully for foreign business languages so that the 6 ECTS points can be credited. E.g. For Business English (Arabic) 1, Business English (Roman) I and Business English (Roman) III must be successfully completed.\nIf you want to take additional modules at the University of Bamberg, you can register for the exams in these modules in the optional additional area. An additional certificate can be issued at the end of your studies.\nRecognized achievements from other universities, e.g. from the preliminary studies or the stay abroad cannot be recognized under the voluntary additional services.\nOnly the most recent module handbook according to your study and examination regulations is always valid and must be used for studying\nGrade calculation\nThe grade in a module group results from the arithmetic mean of the module grades weighted with the credit points and truncated to a decimal point. If the performance in ECTS points exceeds the upper limit of the module, the excess ECTS points will be cut off from the worst-rated module.\nThe final grade results from the weighted arithmetic mean of the grades of the individual modules cut to one decimal place.\nThe examination subjects of the individual module groups are defined in Appendix 1 of the study and subject examination regulations for the degree programs. Basic modules are only not included in the final grade in the seven-semester Bachelor's degree programs. In both the six- and seven-semester bachelor's degree programs, modules from the contextual study are not included in the final grade.\nThe grade shown in the certificate is cut off after the first decimal place. Example: The calculated grade 2.18 is shown as 2.1 on the certificate.\nExams\nAn examination that is taken as part of a course at WIAI can be repeated as often as required within the maximum duration of the course.\nThe Bachelor / Master thesis can only be repeated once.\nIf it is a compulsory elective module, you can choose another module from the compulsory elective area. Please inform the examination office (contact form) for which module you will not take any further exams. Please provide the examination office with this information prior to the examination registration phase. If you do not announce this before the examination registration phase, you may not be able to register for exams in FlexNow or FlexNow will refuse to register for exams!\nFailed achievements are not listed in the final certificate. If voluntary additional services have been completed, a further certificate will be issued on which all passed, voluntary additional services are listed. You can obtain further information on the final certificate from the examination office.\nSee general examination regulations of the WIAI!\n\"§ 20 Final Failure\n(1) If, after the maximum period of study according to § 30 Paragraph 2 StuFPO, not all of the examinations to be performed in the course have been passed, the remaining examinations must be completed within the university semester that follows the end of the maximum period of study. The candidate is requested in writing to do so. If not all of the required examinations have been passed after this period has expired, the respective course is definitely not passed. In this case the examination procedure is over. Examinations that are still outstanding or a bachelor's or master's thesis in progress can no longer be performed as an examination in the sense of these examination regulations. \"\nIf a Bachelor's or Master's thesis has already been registered, it will inevitably count as \"failed for the first time\" if it is not submitted by the end of the regular maximum period of study. So reports e.g. If a student of the Bachelor AI with a standard course duration of 6 semesters (and accordingly a regular maximum course duration of 8 semesters) submits their bachelor thesis one month before the end of the 8th semester, the processing time is no longer the usual 4 months, but only until the end of the regular Maximum duration of study. In this case, according to APO WIAI, § 20, she still has the option of submitting a bachelor thesis and completing her studies. However, once the topic has been started, it may not be worked on; instead, a new topic for the thesis will be issued in the new semester.\nThe submission deadline is stored in FlexNow. A failed Bachelor or Master thesis can be repeated once according to § 18.\nExam registration / problems with registration\nI forgot to register for the exams. What can I do?\nYou are obviously not registered in the VC course of the examination board - there you will be reminded of the examination registration deadlines on a regular basis.\nThe registration deadlines are binding for every student. If you miss this, the registration cannot be made up for. Remember to register for exams in good time in the coming semester. Register for the VC course of the examination board!\nIf you register a module using the FlexNow search during the exam registration phase, this module will be booked in the additional voluntary area and not in the module group intended for it. Modules that are booked in the additional voluntary area do not count towards the study progress control.\nYou should therefore register the tests via the tree view so that these modules are assigned to the corresponding module group.\nNo. Modules do not have to be repeated in the following semester. Instead, you have to register independently for the next desired date if you want to take a repeat exam. If it is a compulsory elective module, you can also choose another module from the compulsory elective area. However, please inform the examination office. Otherwise you may have problems logging into the relevant module group.\nNo, you have to re-register for the exam independently.\nProblems can arise again and again when registering for the exam, in particular it may not be possible to register via FlexNow, although you still have to perform in the respective module groups.\nHow does this problem come about?\nIt is particularly important to ensure that you deregister from exams for which you were once registered but no longer want to take. Here's an example:\nLet us assume that you have registered in a module group (24 ECTS points) for the following modules via FlexNow in WS 19/20:\nDSG-EiAPS-B (6 ECTS points, registered)\nMI-AuD-B (6 ECTS points, registered)\nPSI-IntroSP-B (6 ECTS points, registered)\nHowever, you have only passed DSG-EiAPS-B (6 ECTS points) and MI-AuD-B (6 ECTS points). Unfortunately, you could not take part in PSI-IntroSP-B or you did not pass it.\nIn SS20 you would like to take the following modules:\nSWT-FSE-B (6 ECTS points)\nMOBI-DBS-B (6 ECTS points)\nYou no longer want to attend the PSI-IntroSP-B module.\nIn this case, FlexNow still shows an error when registering because more than 24 ECTS points are booked in the module group.\nReason: The failed module PSI-IntroSP-B counts towards the 24-ECTS point limit!\nHow can you still register for exams in FlexNow without an error message?\nWrite to the examination office which module you no longer want to take and apply for a change in the partial examination accordingly\nWhen should you contact the examination office?\nReport these points before registering for the exam at the start of the respective semester!\nContact at the examination office:\nIf you have problems registering for an exam, please contact the WIAI Examination Office (contact form). Describe the problem in detail and how you think it would normally be presented in FlexNow.\nNo! If you cannot register via FlexNow for a module that you would like to take in the profile development area / additional voluntary area and that is part of the curriculum, contact the WIAI examination office (contact form).\nPlease describe in detail which module you would like to introduce. In most cases, the module can be activated accordingly, so that registration via FlexNow is possible and you do not have to write the exam on a certificate.\nIf it is a compulsory elective module, you can choose another module from the compulsory elective area. Please inform the examination office (contact form) for which module you will not take any further exams.\nPlease provide this information to the Examination Office before the exam registration phase. If you do not announce this before the examination registration phase, you may not be able to register for exams in FlexNow or FlexNow will refuse to register for exams because the module group limit has been exceeded.\nModules that have already been registered and that have not been passed are also incorrectly assessed by FlexNow with the corresponding ECTS points, thus preventing registration if the module group limit is exceeded.\nYes, you should either not register for the exam at all or you should also de-register during the exam de-registration phase.\nIf a module has been registered in the wrong module group, please contact the WIAI Examination Office (contact form) to postpone it during the examination registration.\nMake sure to select the correct module group the next time you register for exams. If you select an exam using the \"Search\" function, the exam is often assigned to the \"optional additional modules\".\nTransition from Bachelor to Master\nYes, you can also book master's modules in the voluntary additional area in the bachelor’s program and have these recognized by the examination board as soon as you are enrolled in the master’s program at the WIAI faculty and you have received the bachelor’s certificate. Make sure that the selected master's modules can be included in the desired master's course according to the module handbook. Send the Examination Board Computer Science / Applied Informatics a corresponding application for recognition (to be found in the VC course of the Examination Board).\nThere is also the option of enrolling in the bachelor's and master's degree programs at the same time, so that you can complete your last examinations in the bachelor's degree and your first examinations in the master's degree in the same semester. The prerequisite for this is that you have already been admitted to the master’s degree. Whether this option makes sense for you is up to you.\nYou can apply for a master’s degree, even if not all grades for successfully completing the bachelor’s degree are available. Even if you are only missing a few ECTS points in your bachelor's degree, you can still apply. If the certificate for enrolment is not yet available, the missing certificate must be submitted to the student office within one year.\nIf you want to complete your Bachelor's degree in WiSe (SoSe), you must complete your last examination by March 31st. (30.09.) Have provided. If your last examination is the bachelor thesis, the last day of the semester is also the last possible submission date.\nIt is possible to enrol in the bachelor's and master's degree programs at the same time, so that you can only submit your bachelor's thesis in the semester in which you want to take master's modules. The prerequisite for this, however, is that you have already been admitted to the master’s degree.\nEntry requirements\nAs there is no ENB clause at the University of Bamberg, you can enrol at the WIAI without any problems.\nRegistration for a bachelor's degree:central deadlines.\nApplication for a master’s degree: The following application deadlines apply to applying for a master’s degree (see announcement of the student office). Please note, however, that for organizational reasons, applications for the winter semester by August 31, and for the summer semester by February 28. should be done one year. After receiving your application, it will be processed immediately and the application process will be completed within a short time. You will then receive an acceptance or rejection and can plan your master’s degree at an early stage.\nYou do not need an orientation or company internship for the course.\nGood German, English and mathematics skills are expected as entry requirements. However, you can identify insufficient knowledge at an early stage, e.g. supplement with a math preparatory course or an English course.\nIf you meet the admission requirements, you can enroll or apply for the degree program that interests you. In the case of special deviations (foreign university entrance qualification, etc.) and for other concerns of foreign students, the International office will help.\nOther\nYou can find the timetable and curriculum presented at the EETs on the student council's website. In addition, the latest brochure also summarizes all the important information that is presented in particular during the introduction to the subject.\nFurther information on how to create the timetable in Univis can be found here. Further practical information for starting your studies can be found on the website of the student office. (Lecture times and deadlines, study grants, internet services, semester ticket, student ID, re-registration, change, leave of absence, de-registration).\nYes, the faculty has its own Career Center. Here you can find out about current events and look for cooperation partners. Current job offers are regularly posted in the VC course „Job exchange WIAI\". If you have detailed questions, you can always contact the Career Center WIAI.\nAs soon as all grades of your bachelor's or master's examination have been booked in FlexNow, the certificate will be issued by the examination office. This must then be signed by the dean of the faculty and the chairman of the examination board. In addition, the certificate of your academic degree will be created and signed by the President. Once all of this has been done, you will be notified and you can pick up your certificate at the examination office.\nIf you are still completing additional voluntary services, the creation of the certificate will be delayed until the end of the respective semester."
}