{
  "url": "https://www.uni-bamberg.de/ma-ai/",
  "title": "M. Sc. Angewandte Informatik",
  "date": "2025-07-01",
  "content": "M. Sc. Angewandte Informatik\nStudienbeginn\nzum Sommer- und\nWintersemester möglich\nRegelstudienzeit\n4 Semester für\ninsgesamt 120 ECTS\nStudienform\nVollzeit- und\nTeilzeitstudium möglich\nAbschluss\nMaster of Science (M. Sc.) nach studienbegleitender Masterprüfung\nInformatik verändert die Welt, in der wir leben. Das Internet, mobile Endgeräte und die Durchdringung vieler Produkte und Prozesse mit Informationstechnologie machen uns dies täglich deutlich. Unser Masterstudiengang in Angewandter Informatik, der Sie auf die vielfältigen Aufgaben, die sich daraus für Informatiker im Beruf ergeben, optimal vorbereitet, setzt daher entsprechende Akzente:\n- Eine fundierte Ausbildung in Informatik, die sich an den üblichen Standards orientiert, schafft die solide Basis.\n- Ein spannendes Angebot an Schwerpunkten wie Ambient Intelligent Interaction, Data Science, Kulturinformatik, Künstliche Intelligenz, Medieninformatik, und Mensch-Computer-Interaktion wird der Fokus auf die wichtige Nahtstelle zwischen Mensch und Computer gelegt.\n- Im Bereich der Anwendungsgebiete geht der Blick über herkömmliche Anwendungen hinaus in die Bereiche Kultur und Medien mit ihren durch hohe mediale und inhaltliche Anforderungen charakterisierten Prozessen der Informationsverarbeitung.\nDer Masterstudiengang der Angewandten Informatik ermutigt Studierende dazu, die Anforderungen in unterschiedlichen Anwendungsgebieten zu verstehen, um Probleme innerhalb dieser Anwendungsfelder gezielt und mit Hilfe moderner Informationstechnologien lösen zu können.\nDer Studiengang bietet verschiedene Ausprägungen und Wahlmöglichkeiten. Beispielsweise können Studierende mit einem großen Interesse an Grundlagen aus einem breiten Spektrum an theoretischen Modulen wählen; Studierende mit einer Präferenz für das praktische Arbeiten können neben der Masterarbeit auch zwei Projekte wählen, in denen praktisch an aktuellen Forschungsthemen gearbeitet wird."
}