{
  "url": "https://www.uni-bamberg.de/ma-ai/qualifikationsziele/",
  "title": "Qualifikationsziele - M. Sc. Angewandte Informatik",
  "date": "2025-07-01",
  "content": "Qualifikationsziele des Studiengangs M.Sc. Angewandte Informatik\nNach Abschluss des Studiums haben die Studierenden folgende Qualifikationsziele erreicht.\nWissenschaftliche Befähigung und Befähigung zu einer qualifizierten Erwerbstätigkeit:\nAbsolvent:innen\n- haben im Rahmen von Übungen und Projekten demonstriert, dass sie Methoden und Verfahren der Informatik und Angewandten Informatik beherrschen und auch in einem unvertrauten, fächerübergreifenden Anwendungskontext (wie z.B. im Bereich der Kultur-, Geistes- und Sozialwissenschaften) angemessen praktisch einsetzen können.\n- haben sich im Rahmen von umfangreichen Forschungsprojekten in kleinen Teams praktisch mit einem aktuellen fachwissenschaftlichen Thema auseinandergesetzt und können Projekte konzipieren, implementieren, evaluieren, dokumentieren und deren Ergebnisse präsentieren.\n- können auch komplexere Methoden und Verfahren der Informatik und Angewandten Informatik selbständig beurteilen und vergleichen und haben wissenschaftliche Methoden in Seminaren selbstständig analysiert, evaluiert und angewandt.\n- haben insbesondere im Rahmen ihrer Abschlussarbeit gezeigt, dass sie eine umfangreiche Forschungsarbeit eigenständig gestalten können, in der sie gelerntes Wissen unter Anwendung von Forschungsmethoden auf eine abgeleitete Forschungsfrage unter Berücksichtigung allgemein anerkannter Grundsätze guter wissenschaftlicher Praxis angewendet und deren Nutzen beurteilt haben.\n- sind mit einem logisch-analytischen, systemischen Denkansatz vertraut, der es ihnen ermöglicht, neuartige Problemstellungen und komplexe Zusammenhänge der Angewandten Informatik auch auf der Grundlage begrenzter Informationen zu untersuchen und Lösungen durch die Integration von vorhandenem und neuem Wissen zu entwickeln.\nPersönlichkeitsentwicklung:\nAbsolvent:innen\n- haben sich in Gruppenarbeiten kritisch mit Methoden und Verfahren der Informatik und Angewandten Informatik und deren Anwendung auseinandergesetzt und hierzu fundiert argumentiert und eigene Beiträge dazu geleistet. Dabei berücksichtigen sie die Sichtweisen Anderer und gehen darauf ein. Sie können Beteiligte unter der Berücksichtigung der jeweiligen Gruppensituation zielorientiert einbinden und unterstützen.\n- können nach dem Besuch der Anwendungsfächer als Schnittstelle zwischen den Disziplinen sachlich fundiert und zielgruppenorientiert vermitteln.\n- können sich eigenverantwortlich in Teams organisieren und Methoden des Projektmanagements praktisch einsetzen.\n- haben aufgrund sehr umfangreicher Wahlmöglichkeiten persönliche und berufliche Schwerpunkte gesetzt.\n- haben ein berufliches Selbstbild entwickelt, welches sie in unterschiedlichen Anwendungskontexten einbringen und erläutern können. Sie haben sich hinsichtlich alternativer Entwürfe hinterfragt und können entsprechende Abgrenzung begründen.\n- können ihre eigenen Fähigkeiten realistisch einschätzen, haben konkrete Vorstellungen entwickelt, wie sie sich beruflich weiterentwickeln möchten und können sich selbständig umfangreiches Fachwissen zielorientiert erschließen.\n- reflektieren die kulturelle und gesellschaftliche Bedeutung ihrer Fachdisziplin sowie die Rolle der Informatik in diversen Anwendungskontexten und beziehen diese Erkenntnisse in ihr Handeln ein.\n- kennen Herangehensweisen an ethische Fragen und Herausforderungen aus Sicht der Informatik und können gesellschaftliche Prozesse kritisch, reflektiert sowie mit Verantwortungsbewusstsein und in demokratischem Gemeinsinn maßgeblich mitgestalten."
}