{
  "url": "https://www.uni-bamberg.de/en/ma-ai/qualification-goals/",
  "title": "Qualification Goals - M. Sc. Applied Computer Science",
  "date": "2025-07-01",
  "content": "Qualification goals of the M.Sc. Applied computer science\nUpon completion of the programme, students will have achieved the following qualification goals.\nScientific aptitude and ability to engage in qualified gainful employment:\nGraduates\n- have demonstrated in the context of exercises and projects that they have mastered methods and procedures of computer science and applied computer science and can also apply them appropriately in practice in an unfamiliar, interdisciplinary application context (such as in the field of cultural studies, humanities and social sciences).\n- have practically dealt with a current subject-related topic within the framework of extensive research projects in small teams and can design, implement, evaluate, document and present the results of projects.\n- can also independently assess and compare more complex methods and procedures of computer science and applied computer science and have independently analysed, evaluated and applied scientific methods in seminars.\n- have shown, especially in the context of their final thesis, that they can independently design an extensive research paper in which they have applied learned knowledge using research methods to a derived research question, taking into account generally accepted principles of good scientific practice, and have assessed its usefulness.\n- are familiar with a logical-analytical, systemic approach to thinking that enables them to investigate novel problems and complex interrelationships in applied computer science even on the basis of limited information and to develop solutions by integrating existing and new knowledge.\nPersonal development:\nGraduates\n- have critically examined methods and procedures of computer science and applied computer science and their application in group work and have made well-founded arguments and contributions of their own. In doing so, they take into account the views of others and respond to them. They can involve and support participants in a goal-oriented manner, taking into account the respective group situation.\n- After attending the application subjects, they can mediate as an interface between the disciplines in a factually sound and target group-oriented manner.\n- can organise themselves independently in teams and use project management methods practically.\n- have set personal and professional priorities due to very extensive elective options.\n- have developed a professional self-image which they can introduce and explain in different application contexts. They have questioned themselves with regard to alternative designs and can justify corresponding demarcation.\n- can realistically assess their own abilities, have developed concrete ideas on how they would like to develop professionally and can independently acquire extensive specialised knowledge in a goal-oriented manner.\n- reflect on the cultural and social significance of their subject discipline as well as the role of computer science in various application contexts and incorporate these findings in their actions.\n- are familiar with approaches to ethical questions and challenges from the perspective of informatics and can play a decisive role in shaping social processes critically, reflectively and with a sense of responsibility and democratic public spirit."
}