{
  "url": "https://www.uni-bamberg.de/ma-ai/inhalt/",
  "title": "Struktur und Inhalt - M. Sc. Angewandte Informatik",
  "date": "2025-07-01",
  "content": "Struktur und Inhalt\nDas Masterstudium besteht aus sechs Modulgruppen, die im Folgenden kurz vorgestellt werden.\nSie sind Angewandte Informatik, Informatik, Anwendungsfächer sowie Wirtschaftsinformatik, Seminare, Projekte und Masterarbeit.\nBesonderes Gewicht kommt hierbei dem angeleiteten Selbststudium zu, das durch mindestens zwei Masterseminare, bis zu zwei forschungsorientierte Projekte—im Umfang von jeweils 15 ECTS-Punkte — und eine Masterarbeit im Umfang von 30 ECTS-Punkten repräsentiert ist.\nIn dieser Modulgruppe werden forschungsnahe Themen der Angewandten Informatik vermittelt. Je nach Interessens-schwerpunkt können Module in den Fächern Computergrafik, Erklärbares Maschinelles Lernen, Grundlagen der Sprachverarbeitung, Informationsvisualisierung, KI-Systementwicklung, Kognitive Systeme, Kulturinformatik, Medieninformatik, Mensch-Computer-Interaktion, Multimodal Intelligent Interaction, Sprachgenerierung und Dialogsysteme belegt werden.\nBeispielhafte Modulwahlmöglichkeiten:\n- Deep Learning\n- Computational Metaphysics\n- Virtual Reality / Augmented Reality\n- Advanced Information Visualization & Visual Analytics\n- Ethics and Epistemology of AI\n- Universelle Logik und Universelles Schließen\n- Information Retrieval\n- Mensch-Computer-Interaktion\n- Usability in der Praxis\n- Multimodal Interaction Design\n- Advanced Dialogue Systems and Conversational AI\n- Kognitive Modellierung\n- Applied Natural Language Processing\n- Impacts of Language Technology\n- Urban Interaction Design\nIn der Modulgruppe A2 lassen sich gezielt Module der Informatik wählen.\nBeispielhafte Modulwahlmöglichkeiten:\n- Tree decompositions, algorithms and games\n- Datenbanksysteme für moderne CPU\n- Data Streams and Complex Event Processing\n- Operating Systems Engineering\n- Applied Software Verfication\n- Functional Programming of Reactive Systems\n- Advanced Security and Privacy\n- Differential Privacy\nEs lassen sich optional Fachkenntnisse in Anwendungsfächern wie Wirtschaftsinformatik, Geowissenschaften, Soziologie, Denkmalpflege, Psychologie, Wirtschaftspädagogik oder Kommunikationswissenschaften erwerben.\nIn dieser Modulgruppe ist ein Masterprojekt (15 ECTS) in Angewandter Informatik zu absolvieren. Ein weiteres Masterprojekt (15 ECTS) im Bereich der Angewandten Informatik oder ein bis zwei Projekte (je 6 ECTS) in Angewandter Informatik oder Informatik sind optional.\nIn der Modulgruppe A5 Seminare sind zwei oder drei Masterseminare im Umfang von jeweils 3 ECTS-Punkten zu absolvieren, von denen mindestens zwei aus der Fächergruppe der Angewandten Informatik (d.h. höchstens eines der Informatik bzw. Wirtschaftsinformatik) zu entnehmen sind. Die Modulprüfung in jedem Seminar wird durch ein Referat mit schriftlicher Hausarbeit erbracht.\nEine Masterarbeit ist eine wissenschaftliche Arbeit, die selbstständig innerhalb von 6 Monaten erstellt wird. Diese wird in einem Fach der Angewandten Informatik geschrieben. Andere Bereiche sind nur auf Antrag möglich. Die Masterarbeit ist mündlich zu verteidigen."
}