{
  "url": "https://www.uni-bamberg.de/en/ma-ai/structure/",
  "title": "Structure and Curriculum - M. Sc. Applied Computer Science",
  "date": "2025-07-01",
  "content": "Structure and Curriculum\nThe master’s degree programme comprises the six module groups outlined below.\nParticular importance is placed on guided individual studies represented by at least two master’s seminars, up to two research-oriented projects—each with 15 ECTS credit points—and a master’s thesis comprising 30 ECTS credit points.\nIn this module group, research-related topics in applied computer science are taught. Depending on the focus of interest, modules can be taken in Computer Graphics, Explainable Machine Learning, Fundamentals of Language Processing, Information Visualisation, AI System Development, Cognitive Systems, Computing in the Cultural Sciences, Media Informatics, Human-Computer-Interaction, Multimodal Intelligent Interaction, Language Generation, and Dialogue Systems.\nExemplary module selection options:\n- Deep Learning\n- Computational Metaphysics\n- Virtual Reality / Augmented Reality\n- Advanced Information Visualization & Visual Analytics\n- Ethics and Epistemology of AI\n- Universal Logic & Universal Reasoning\n- Information Retrieval\n- Human-Computer-Interaction\n- Usability in Practice\n- Multimodal Interaction Design\n- Advanced Dialogue Systems and Conversational AI\n- Cognitive Modelling\n- Applied Natural Language Processing\n- Impacts of Language Technology\n- Urban Interaction Design\nIn the A2 module group, students focus on specific topics in computer science.\nExemplary module selection options:\n- Tree decompositions, algorithms and games\n- Database Systems for modern CPU\n- Data Streams and Complex Event Processing\n- Operating Systems Engineering\n- Applied Software Verfication\n- Functional Programming of Reactive Systems\n- Advanced Security and Privacy\n- Differential Privacy\nOptionally, it is possible to acquire specialised knowledge in application subjects such as information systems, geosciences, sociology, heritage conservation, psychology, business and human education, or communication sciences.\nIn this module group, a Master's project (15 ECTS) in Applied Computer Science must be completed. A further Master's project (15 ECTS) in the field of Applied Computer Science or one or two projects (6 ECTS each) in Applied Computer Science or Computer Science are optional.\nIn the module group A5 students complete two to three seminars, each including an oral presentation and a term paper. At least two seminars are from the fields of applied computer science and one optional third seminar can be from the computer science and information systems.\nA Master's thesis is an academic paper that is written independently within 6 months. It is completed in a subject of Applied Computer Science. Other fields are only possible on application. The Master's thesis must be defended orally."
}