{
  "url": "https://www.uni-bamberg.de/ma-ai/teilzeitstudium/",
  "title": "Teilzeitstudium - M. Sc. Angewandte Informatik",
  "date": "2025-07-01",
  "content": "Teilzeitstudium\nAlle Studiengänge der Fakultät WIAI können als Teilzeitstudiengänge studiert werden.\nDas Teilzeitstudium bietet gerade für Studierende mit Kindern, für Studierende mit Nebentätigkeiten oder für Studierende mit Behinderung bzw. chronischen Erkrankungen eine Chance, die Studienbelastung während des Semesters zu reduzieren und dafür die Studiendauer zu verlängern.\nDie Studiendauer der Bachelorstudiengänge der Fakultät WIAI ändert sich von 6 bzw. 7 Semestern auf 12 bzw. 14 Semester im Teilzeitstudium. Die Studiendauer der Masterstudiengänge von 3 bzw. 4 Semestern auf 6 bzw. 8 Semester.\nDie Einschreibung in einen Teilzeitstudiengang ist ohne Angabe von Gründen möglich. Der Wechsel von Vollzeit in Teilzeit ist bis zum Ende der Regelstudienzeit des jeweiligen Vollzeitstudiengangs in jedem Semester innerhalb der jeweiligen Einschreibefrist möglich. Der Wechsel von Teilzeit in Vollzeit ist in jedem Semester innerhalb der jeweiligen Einschreibefrist möglich, sofern im bisher belegten Teilzeitstudiengang eine gerade Anzahl an Fachsemestern studiert wurde. Die geforderten Studienleistungen halbieren sich pro Semester entsprechend. Der Semesterbeitrag (Studentenwerksbeitrag und Semesterticket) muss komplett gezahlt werden.\nWeitere Informationen zum Teilzeitstudium finden Sie auf den zentralen Seiten der Universität.\nOrdnungen für das Teilzeitstudium\nAb Wintersemester 2023/24 geltende Fassung:\n- Änderungssatzung vom 31. März 2025(97.5 KB)\nBis einschließlich Sommersemester 2023 geltende Fassung:\n- Dreizehnte Änderungssatzung vom 24. November 2022(125.7 KB, 4 Seiten)\n- Zwölfte Änderungssatzung vom 30. September 2022(101.5 KB)\n- Elfte Änderungssatzung vom 30. Juli 2020(107.7 KB)\n- Zehnte Änderungssatzung vom 15. März 2019(103.3 KB, 2 Seiten)\n- Neunte Änderungssatzung vom 28. Februar 2018(274.9 KB, 3 Seiten)\n- Achte Änderungssatzung vom 10. August 2017(98.1 KB, 3 Seiten)\n- Siebente Änderungssatzung vom 30. September 2016(100.0 KB, 3 Seiten)\n- Sechste Änderungssatzung vom 1. März 2016(193.8 KB, 2 Seiten)\n- Fünfte Änderungssatzung vom 31. Juli 2014(195.6 KB, 3 Seiten)\n- Vierte Änderungssatzung vom 14. August 2013(74.3 KB, 4 Seiten)\n- Dritte Änderungsordnung vom 31. Januar 2013(80.0 KB, 3 Seiten)\n- Zweite Änderungsordnung vom 31. August 2012(81.7 KB, 3 Seiten)\n- Änderungsordnung vom 30. September 2011(97.7 KB, 2 Seiten)"
}